#Задание_1

example_str = '***---Добро пожаловать!---***'
print(example_str.strip('*-'))
